#include <iostream>
using namespace std;


int main(){

    // int a = 10;
    // int b = 20;
    // int* pa = &a; //指针取地址 *位置随意
    
    //指针变量是指变量类型为指针
    // printf("%#X\n%#X\n%#X\n ",&a,&b,pa);

    // *pa = 7;
    // cout << a << endl;

    //*和&的区别，两者是互逆的关系
    // *&a = *(&a) = *pa = a;
    // &*pa = &(*pa) = &a = pa; 


    //指针和数组之间的关系
    // int c[5] = {1,6,3,4,5};
    // int* p = c ;

    // cout << &c[2] << "  " << p+2 << endl; 
    // cout << c[0] << ' ' << *(p+1) << endl;

    //遍历数组
    // for(int i=0; i<5;i++){
    //     cout <<"数组的第" << (i+1)<< "个元素的值" << *p <<"地址为"<< p<<endl;
    //     p++;
    // }


    //指针数组
    int mat[3][4]={
        {1,2,3,4},
        {4,5,6,7},
        {7,8,9,10}
    };
    int *pmat[3]; //指针数组：本质上是数组，数组内元素全部都是指针
    pmat[0]=mat[0];
    pmat[1]=mat[1];
    pmat[2]=mat[2];
    // for (int i=0;i<3;++i){
    //     for(int j=0;j<4;++j){
    //         cout<<*(pmat[i]+j)<<"  "; //解引用取值，同时利用了指针可以偏移的特点
    //     }
    //     cout<<endl;
    // }


    //使用二维数组地址时，*(a+i)与a[i]与a+i是等价的
    //数组指针：本质上是指针，其本质上是一个值，他指向的是一组数据
    //数组指针是一个二级的指针，是地址的地址
    int (*p)[5];//可以类比为二维数组，二维数组是行优先进行存储

    int a[5][5]={
        {1,2,3,4,5},
        {5,5,5,5,5},
        {1,3,6,9,0},
        {7,7,7,7,7}
    };
    p = a; //如果改为a[4][6]就会报错，因为作为一个值，指向整个数组，必须要是列相等
    cout << p << "相较于数组" <<  &a[0] << endl;
    cout << p << "相较于" <<  *p << endl; //因为p本质上已经是一组数了，所以解引用也只会保持原值
    cout <<"数组a[0] "<< a[0] << endl;
    cout <<"数组a[1] " << a[1] << endl;
    cout <<"指针P  " << p + 1 << endl;
    cout << p + 1 << endl;
    cout << *(p + 1) << endl; 
    cout << *p + 1 << "相较于" <<  &a[1] << endl; //相当于同一行内进行指针迁移
    cout << *(p + 1) << "相较于" <<  &a[1] << endl;
    cout << *(*(p + 3)) << "相较于" <<  *a[1]  << endl; //按照列来移动


    return 0;
}